{"format": "graph-model", "generatedBy": "pytorch-to-tfjs", "convertedBy": "pytorch-to-tfjs-converter", "modelTopology": {"node": [{"name": "dense_feature_encoder", "op": "Custom", "input": ["x_reference"], "output": ["f_r"]}, {"name": "latent_token_encoder_current", "op": "Custom", "input": ["x_current"], "output": ["t_c"]}, {"name": "latent_token_encoder_reference", "op": "Custom", "input": ["x_reference"], "output": ["t_r"]}, {"name": "latent_token_decoder_current", "op": "Custom", "input": ["t_c"], "output": ["m_c"]}, {"name": "latent_token_decoder_reference", "op": "Custom", "input": ["t_r"], "output": ["m_r"]}, {"name": "implicit_motion_alignment_0", "op": "Custom", "input": ["m_c_0", "m_r_0", "f_r_0"], "output": ["aligned_feature_0"]}, {"name": "implicit_motion_alignment_1", "op": "Custom", "input": ["m_c_1", "m_r_1", "f_r_1"], "output": ["aligned_feature_1"]}, {"name": "implicit_motion_alignment_2", "op": "Custom", "input": ["m_c_2", "m_r_2", "f_r_2"], "output": ["aligned_feature_2"]}, {"name": "implicit_motion_alignment_3", "op": "Custom", "input": ["m_c_3", "m_r_3", "f_r_3"], "output": ["aligned_feature_3"]}, {"name": "frame_decoder", "op": "Custom", "input": ["aligned_feature_0", "aligned_feature_1", "aligned_feature_2", "aligned_feature_3"], "output": ["x_reconstructed"]}], "input": [{"name": "x_current", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}, {"name": "x_reference", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}], "output": [{"name": "x_reconstructed", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}]}, "weightsManifest": []}