{"format": "layers-model", "generatedBy": "keras v3.6.0", "convertedBy": "TensorFlow.js Converter v4.21.0", "modelTopology": {"keras_version": "3.6.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 3, 256, 256], "dtype": "float32", "sparse": false, "name": "input_layer"}, "name": "input_layer", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_shape": [null, 3, 256, 256], "dtype": "float32", "sparse": false, "name": "input_layer_1"}, "name": "input_layer_1", "inbound_nodes": []}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": 1}, "name": "concatenate", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 3, 256, 256], "dtype": "float32", "keras_history": ["input_layer", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 3, 256, 256], "dtype": "float32", "keras_history": ["input_layer_1", 0, 0]}}]], "kwargs": {}}]}], "input_layers": [["input_layer", 0, 0], ["input_layer_1", 0, 0]], "output_layers": [["concatenate", 0, 0]]}}}, "weightsManifest": [{"paths": [], "weights": []}]}